
[_NOTICE_]
ENCODING_USING=UTF16_LE
FIRST_LAUNCH#注释=首次启动？若想重新进入首次使用教学，请改为 1 并保存，然后使用 Ctrl+Alt+\ 重载 CapsLockX。
FIRST_LAUNCH=1
[Core]
T_XKeyAsSpace#注释=使用 Space 作为引导键（默认启用，游戏玩家可在 .user.ignore.txt 里配置忽略游戏窗口）
T_XKeyAsSpace=0
T_XKeyAsCapsLock#注释=使用 CapsLock 作为引导键（默认启用）
T_XKeyAsCapsLock=1
T_XKeyAsInsert#注释=使用 Insert 作为引导键
T_XKeyAsInsert=0
T_XKeyAsScrollLock#注释=使用 ScrollLock 作为引导键
T_XKeyAsScrollLock=0
T_XKeyAsRAlt#注释=使用 右 Alt 作为引导键
T_XKeyAsRAlt=0
T_AskRunAsAdmin#注释=请求管理员权限（权限受限时，权限受限，例如鼠标模拟等功能无法正常运行，默认请求提升权限，如果不需要管理权限下的功能，可以改为0）
T_AskRunAsAdmin=0
CLX_CONFIG_ONSTARTUP#注释=启动时显示配置窗口
CLX_CONFIG_ONSTARTUP=0
[Advanced]
T_AutoReloadOnConfigsChange#注释=用户配置修改保存时自动重载
T_AutoReloadOnConfigsChange=0
T_UseScrollLockLight#注释=进阶： 是否使用 ScrollLock 灯来显示 CapsLockX 状态（不建议）
T_UseScrollLockLight=0
T_UseCapsLockLight#注释=进阶： 是否使用 CapsLockX 灯来显示 CapsLockX 状态（强烈不建议）
T_UseCapsLockLight=0
T_SwitchSound#注释=进阶： 是否开启CapsLockX模式切换声音提示（默认不开）
T_SwitchSound=0
T_SwitchSoundOn#注释=CapsLockX 按下声音提示路径
T_SwitchSoundOn=./Data/NoteG.mp3
T_SwitchSoundOff#注释=CapsLockX 弹起声音提示路径
T_SwitchSoundOff=./Data/NoteC.mp3
T_SwitchTrayIconOff#注释=CapsLockX弹起托盘显示图标，默认为 ./Data/XIconWhite.ico
T_SwitchTrayIconOff=./Data/XIconWhite.ico
T_SwitchTrayIconOn#注释=CapsLockX按下托盘显示图标，默认为 ./Data/XIconBlue.ico
T_SwitchTrayIconOn=./Data/XIconBlue.ico
[ModuleDisable]
THelp_Disabled#注释=是否禁用模块：Help - 用于提供帮助函数，打开 CapsLockX 的 Github 页面，不可禁用
THelp_Disabled=0
TQuickTips_Disabled#注释=是否禁用模块：QuickTips
TQuickTips_Disabled=0
TSNOCLICK_Disabled#注释=是否禁用模块：SNOCLICK
TSNOCLICK_Disabled=0
T鼠标模拟_Disabled#注释=是否禁用模块：鼠标模拟 - WASD鼠标移动，QE 左右键 RF滚轮
T鼠标模拟_Disabled=0
T编辑增强_Disabled#注释=是否禁用模块：编辑增强 - YUIO HJKL 操作光标 GT 回车删除
T编辑增强_Disabled=0
TVirtualDesktop_Disabled#注释=是否禁用模块：VirtualDesktop
TVirtualDesktop_Disabled=0
TWindowManager_Disabled#注释=是否禁用模块：WindowManager
TWindowManager_Disabled=0
TBlenderEnhanced_Disabled#注释=是否禁用模块：BlenderEnhanced
TBlenderEnhanced_Disabled=0
TEnterWithoutBreak_Disabled#注释=是否禁用模块：EnterWithoutBreak - 不折行回车
TEnterWithoutBreak_Disabled=0
TCapsLockX_Elevate_Disabled#注释=是否禁用模块：CapsLockX_Elevate - 用于询问是否使用管理员权限启动
TCapsLockX_Elevate_Disabled=0
TCapsLockX_Pause_Disabled#注释=是否禁用模块：CapsLockX_Pause
TCapsLockX_Pause_Disabled=0
TCapsLockX_Reload_Disabled#注释=是否禁用模块：CapsLockX_Reload
TCapsLockX_Reload_Disabled=0
TCapsLockX_用户脚本_Disabled#注释=是否禁用模块：CapsLockX_用户脚本 - 快速窗口热键编辑
TCapsLockX_用户脚本_Disabled=0
TEmojiSearchByPreferLanguage_Disabled#注释=是否禁用模块：EmojiSearchByPreferLanguage - Search emoji by prefer language
TEmojiSearchByPreferLanguage_Disabled=0
TJavascript_Disabled#注释=是否禁用模块：Javascript
TJavascript_Disabled=0
TLaptopKeyboardFix_Disabled#注释=是否禁用模块：LaptopKeyboardFix - 拯救笔记本
TLaptopKeyboardFix_Disabled=0
Tlib_bindWins_Disabled#注释=是否禁用模块：lib_bindWins
Tlib_bindWins_Disabled=1
TSnoChordTyping_Disabled#注释=是否禁用模块：SnoChordTyping - 启用雪星并击，创建于(20200722) 文档请见主页 [雪星并击 snochorded sno-chord-typing | snochorded]( https://snomiao.github.io/snochorded/ )
TSnoChordTyping_Disabled=0
T快捷输入_Disabled#注释=是否禁用模块：快捷输入 - 快速输入各种时间戳和随机数
T快捷输入_Disabled=0
T锁屏时自动息屏_Disabled#注释=是否禁用模块：锁屏时自动息屏
T锁屏时自动息屏_Disabled=0
TAcrobat增强_Disabled#注释=是否禁用模块：Acrobat增强
TAcrobat增强_Disabled=0
TAnki增强_Disabled#注释=是否禁用模块：Anki增强
TAnki增强_Disabled=0
TCursor_Disabled#注释=是否禁用模块：Cursor
TCursor_Disabled=0
TLoopbackExemptionManager_Disabled#注释=是否禁用模块：LoopbackExemptionManager
TLoopbackExemptionManager_Disabled=0
TMobaXterm_Disabled#注释=是否禁用模块：MobaXterm
TMobaXterm_Disabled=0
TOneNote2016增强_Disabled#注释=是否禁用模块：OneNote2016增强
TOneNote2016增强_Disabled=0
TOneNoteMetro拓展_Disabled#注释=是否禁用模块：OneNoteMetro拓展
TOneNoteMetro拓展_Disabled=0
T文明6回车左置_Disabled#注释=是否禁用模块：文明6回车左置
T文明6回车左置_Disabled=0
T桌面QQ增强_Disabled#注释=是否禁用模块：桌面QQ增强
T桌面QQ增强_Disabled=0
T讯飞输入法语音悬浮窗_Disabled#注释=是否禁用模块：讯飞输入法语音悬浮窗
T讯飞输入法语音悬浮窗_Disabled=0
T媒体键_Disabled#注释=是否禁用模块：媒体键
T媒体键_Disabled=0
T开机运行_Disabled#注释=是否禁用模块：开机运行 - 用于把clx添加到用户startup文件夹。
T开机运行_Disabled=0
T控制台启用CtrlV粘贴_Disabled#注释=是否禁用模块：控制台启用CtrlV粘贴
T控制台启用CtrlV粘贴_Disabled=0
T用户脚本编辑_Disabled#注释=是否禁用模块：用户脚本编辑 - 快速窗口热键编辑
T用户脚本编辑_Disabled=0
T番茄时钟_Disabled#注释=是否禁用模块：番茄时钟 - 番茄时钟
T番茄时钟_Disabled=0
T配置修改_Disabled#注释=是否禁用模块：配置修改 - 提供一个GUI用于 修改 CLX 的配置，热键为 CapsLockX+m
T配置修改_Disabled=0
[TMouse]
Disabled#注释=禁用模拟鼠标模块
Disabled=0
SendInput#注释=使用 SendInput 方法提高模拟鼠标点击、移动性能
SendInput=1
SendInputAPI#注释=使用 Windows API 强势提升模拟鼠标移动性能
SendInputAPI=1
TMouse_SendInputScroll#注释=使用 Windows API 强势提升模拟鼠标滚轮性能（目前有bug不建议启用）
TMouse_SendInputScroll=0
StickyCursor#注释=启用自动粘附各种按钮，编辑框
StickyCursor=1
StopAtScreenEdge#注释=撞上屏幕边界后停止加速
StopAtScreenEdge=1
UseDPIRatio#注释=是否根据屏幕 DPI 比率缩放鼠标速度
UseDPIRatio=1
MouseSpeedRatio#注释=鼠标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类
MouseSpeedRatio=3
WheelSpeedRatio#注释=滚轮加速度比率, 默认为 1, 你想慢点就改成 0.5 之类
WheelSpeedRatio=1
[EditEnhance]
SpeedRatioX#注释=光标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类
SpeedRatioX=1
SpeedRatioY#注释=光标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类
SpeedRatioY=1
PageSpeed#注释=翻页速率
PageSpeed=1
TurboTab#注释=Tab键加速，可能和一些游戏不兼容，默认禁用
TurboTab=0
[VirtualDesktopPinPattern]
p1#注释=Pin matched window to desktop 1
p1=#Desktop1
p2#注释=Pin matched window to desktop 2
p2=#Desktop2
p3#注释=Pin matched window to desktop 3
p3=#Desktop3
p4#注释=Pin matched window to desktop 4
p4=#Desktop4
p5#注释=Pin matched window to desktop 5
p5=#Desktop5
p6#注释=Pin matched window to desktop 6
p6=#Desktop6
p7#注释=Pin matched window to desktop 7
p7=#Desktop7
p8#注释=Pin matched window to desktop 8
p8=#Desktop8
p9#注释=Pin matched window to desktop 9
p9=#Desktop9
p0#注释=Pin matched window to desktop 0
p0=#Desktop0
[窗口增强]
鼠标位置记忆尝试#注释=在CLX+Z窗口切换时记住还原鼠标在每个窗口中的位置
鼠标位置记忆尝试=1
[LKF]
WinKeySimulate#注释=右手 \][ 模拟Windows键和 Alt + Tab， 具体用法参见LaptopKeyboardFix 模块说明，默认启用
WinKeySimulate=1
[Plugins]
EnableSnoChordTyping#注释=启用雪星并击（实验中），
EnableSnoChordTyping=0
[TomatoLife]
Enable#注释=使用番茄时钟（默认禁用，改为 1 开启）
Enable=0
NoticeOnLaunch#注释=启动时报告番茄状态
NoticeOnLaunch=1
UseTomatoLife#注释=使用番茄报时（00分和30分播放工作铃声，每小时的25分和55分播放休息铃声）（需要先开启番茄时钟）
UseTomatoLife=1
UseTomatoLifeSwitchVirtualDesktop#注释=使用番茄报时时，自动切换桌面（休息桌面为1，工作桌面为2）
UseTomatoLifeSwitchVirtualDesktop=1
[CLX_LKF]
FLAG_SWAP_ESC_STROKE#注释=交换ESC和~键，你可以按CLX+Esc来切换这个选项
FLAG_SWAP_ESC_STROKE=0
